# Predict Clicked Ads Customer Classification

In [59]:
import pandas as pd
df = pd.read_csv('Clicked Ads Dataset.csv')
df

,Unnamed: 0,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Clicked on Ad,city,province,category
0,0,68.95,35,432837300.0,256.09,Perempuan,3/27/2016 0:53,No,Jakarta Timur,Daerah Khusus Ibukota Jakarta,Furniture
1,1,80.23,31,479092950.0,193.77,Laki-Laki,4/4/2016 1:39,No,Denpasar,Bali,Food
2,2,69.47,26,418501580.0,236.50,Perempuan,3/13/2016 20:35,No,Surabaya,Jawa Timur,Electronic
3,3,74.15,29,383643260.0,245.89,Laki-Laki,1/10/2016 2:31,No,Batam,Kepulauan Riau,House
4,4,68.37,35,517229930.0,225.58,Perempuan,6/3/2016 3:36,No,Medan,Sumatra Utara,Finance
...,...,...,...,...,...,...,...,...,...,...,...
995,995,72.97,30,499691990.0,208.58,Laki-Laki,2/11/2016 21:49,Yes,Semarang,Jawa Tengah,Finance
996,996,51.30,45,474475190.0,134.42,Laki-Laki,4/22/2016 2:07,Yes,Pakanbaru,Riau,Electronic
997,997,NaN,51,296910040.0,120.37,Laki-Laki,2/1/2016 17:24,Yes,Samarinda,Kalimantan Timur,Travel
998,998,55.55,19,293445530.0,187.95,Perempuan,3/24/2016 2:35,No,Tangerang,Banten,Bank
999,999,45.01,26,209130600.0,178.35,Perempuan,6/3/2016 21:43,Yes,Serang,Banten,Travel

# Cleaning

In [60]:
df = df.drop('Unnamed: 0', axis='columns')
df

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Clicked on Ad,city,province,category
0,68.95,35,432837300.0,256.09,Perempuan,3/27/2016 0:53,No,Jakarta Timur,Daerah Khusus Ibukota Jakarta,Furniture
1,80.23,31,479092950.0,193.77,Laki-Laki,4/4/2016 1:39,No,Denpasar,Bali,Food
2,69.47,26,418501580.0,236.50,Perempuan,3/13/2016 20:35,No,Surabaya,Jawa Timur,Electronic
3,74.15,29,383643260.0,245.89,Laki-Laki,1/10/2016 2:31,No,Batam,Kepulauan Riau,House
4,68.37,35,517229930.0,225.58,Perempuan,6/3/2016 3:36,No,Medan,Sumatra Utara,Finance
...,...,...,...,...,...,...,...,...,...,...
995,72.97,30,499691990.0,208.58,Laki-Laki,2/11/2016 21:49,Yes,Semarang,Jawa Tengah,Finance
996,51.30,45,474475190.0,134.42,Laki-Laki,4/22/2016 2:07,Yes,Pakanbaru,Riau,Electronic
997,NaN,51,296910040.0,120.37,Laki-Laki,2/1/2016 17:24,Yes,Samarinda,Kalimantan Timur,Travel
998,55.55,19,293445530.0,187.95,Perempuan,3/24/2016 2:35,No,Tangerang,Banten,Bank
999,45.01,26,209130600.0,178.35,Perempuan,6/3/2016 21:43,Yes,Serang,Banten,Travel

In [61]:
df['Timestamp'] = pd.to_datetime(df['Timestamp'])
df['hour'] = df['Timestamp'].dt.hour
df['month'] = df['Timestamp'].dt.month
df['timestamp'] = df['Timestamp'].dt.strftime('%m/%d/%Y')
df

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Clicked on Ad,city,province,category,hour,month,timestamp
0,68.95,35,432837300.0,256.09,Perempuan,2016-03-27 00:53:00,No,Jakarta Timur,Daerah Khusus Ibukota Jakarta,Furniture,0,3,03/27/2016
1,80.23,31,479092950.0,193.77,Laki-Laki,2016-04-04 01:39:00,No,Denpasar,Bali,Food,1,4,04/04/2016
2,69.47,26,418501580.0,236.50,Perempuan,2016-03-13 20:35:00,No,Surabaya,Jawa Timur,Electronic,20,3,03/13/2016
3,74.15,29,383643260.0,245.89,Laki-Laki,2016-01-10 02:31:00,No,Batam,Kepulauan Riau,House,2,1,01/10/2016
4,68.37,35,517229930.0,225.58,Perempuan,2016-06-03 03:36:00,No,Medan,Sumatra Utara,Finance,3,6,06/03/2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,72.97,30,499691990.0,208.58,Laki-Laki,2016-02-11 21:49:00,Yes,Semarang,Jawa Tengah,Finance,21,2,02/11/2016
996,51.30,45,474475190.0,134.42,Laki-Laki,2016-04-22 02:07:00,Yes,Pakanbaru,Riau,Electronic,2,4,04/22/2016
997,NaN,51,296910040.0,120.37,Laki-Laki,2016-02-01 17:24:00,Yes,Samarinda,Kalimantan Timur,Travel,17,2,02/01/2016
998,55.55,19,293445530.0,187.95,Perempuan,2016-03-24 02:35:00,No,Tangerang,Banten,Bank,2,3,03/24/2016
999,45.01,26,209130600.0,178.35,Perempuan,2016-06-03 21:43:00,Yes,Serang,Banten,Travel,21,6,06/03/2016

# Goals
1. Efektifitas Ads 
2. Daily time spent customer
3. Semakin banyak daily time spent maka banyak user yang melihat

In [62]:
df_clean = df.dropna()
df_clean

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Clicked on Ad,city,province,category,hour,month,timestamp
0,68.95,35,432837300.0,256.09,Perempuan,2016-03-27 00:53:00,No,Jakarta Timur,Daerah Khusus Ibukota Jakarta,Furniture,0,3,03/27/2016
1,80.23,31,479092950.0,193.77,Laki-Laki,2016-04-04 01:39:00,No,Denpasar,Bali,Food,1,4,04/04/2016
2,69.47,26,418501580.0,236.50,Perempuan,2016-03-13 20:35:00,No,Surabaya,Jawa Timur,Electronic,20,3,03/13/2016
3,74.15,29,383643260.0,245.89,Laki-Laki,2016-01-10 02:31:00,No,Batam,Kepulauan Riau,House,2,1,01/10/2016
4,68.37,35,517229930.0,225.58,Perempuan,2016-06-03 03:36:00,No,Medan,Sumatra Utara,Finance,3,6,06/03/2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...
994,43.70,28,441888720.0,173.01,Perempuan,2016-04-04 03:57:00,Yes,Tasikmalaya,Jawa Barat,Fashion,3,4,04/04/2016
995,72.97,30,499691990.0,208.58,Laki-Laki,2016-02-11 21:49:00,Yes,Semarang,Jawa Tengah,Finance,21,2,02/11/2016
996,51.30,45,474475190.0,134.42,Laki-Laki,2016-04-22 02:07:00,Yes,Pakanbaru,Riau,Electronic,2,4,04/22/2016
998,55.55,19,293445530.0,187.95,Perempuan,2016-03-24 02:35:00,No,Tangerang,Banten,Bank,2,3,03/24/2016
999,45.01,26,209130600.0,178.35,Perempuan,2016-06-03 21:43:00,Yes,Serang,Banten,Travel,21,6,06/03/2016

# Feature Engineering

In [63]:
df_clean.sample(5)

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Clicked on Ad,city,province,category,hour,month,timestamp
733,44.11,41,301779870.0,121.24,Laki-Laki,2016-04-20 16:49:00,Yes,Medan,Sumatra Utara,Finance,16,4,04/20/2016
897,77.36,41,347179560.0,115.79,Perempuan,2016-02-26 06:00:00,Yes,Surabaya,Jawa Timur,Travel,6,2,02/26/2016
448,51.87,50,363089090.0,119.65,Perempuan,2016-03-10 22:28:00,Yes,Surabaya,Jawa Timur,Food,22,3,03/10/2016
70,46.13,31,421742790.0,139.01,Perempuan,2016-02-01 09:00:00,Yes,Bandung,Jawa Barat,Bank,9,2,02/01/2016
575,48.86,54,372320830.0,134.46,Perempuan,2016-01-09 17:33:00,Yes,Jakarta Selatan,Daerah Khusus Ibukota Jakarta,Furniture,17,1,01/09/2016

In [64]:
# mapnum = set(df_clean[['Male', 'Clicked on Ad', 'category']])
# for x in mapnum:
#     for i, x in enumerate(set(df_clean[x]), start=1):
#         mapnum = x:i

In [65]:
set(df_clean.category)

{'Bank',
 'Electronic',
 'Fashion',
 'Finance',
 'Food',
 'Furniture',
 'Health',
 'House',
 'Otomotif',
 'Travel'}

In [66]:
male_mapping = {'Perempuan':0,
                'Laki-Laki':1}
df_clean['male'] = df_clean['Male'].map(male_mapping)

ad_mapping = {'No':0,
              'Yes':1}
df_clean['adclicked'] = df_clean['Clicked on Ad'].map(ad_mapping)

cat_mapping = {'Bank':0,
               'Electronic':1,
               'Fashion':2,
               'Finance':3,
               'Food':4,
               'Furniture':5,
               'Health':6,
               'House':7,
               'Otomotif':8,
               'Travel':9}
df_clean['catego'] = df_clean['category'].map(cat_mapping)

C:\Users\User\AppData\Local\Temp\ipykernel_19292\1076106485.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean['male'] = df_clean['Male'].map(male_mapping)
C:\Users\User\AppData\Local\Temp\ipykernel_19292\1076106485.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean['adclicked'] = df_clean['Clicked on Ad'].map(ad_mapping)
C:\Users\User\AppData\Local\Temp\ipykernel_19292\1076106485.py:19: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean['catego'] = df_clean['category'].map(cat_mapping)

In [67]:
df_clean

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Clicked on Ad,city,province,category,hour,month,timestamp,male,adclicked,catego
0,68.95,35,432837300.0,256.09,Perempuan,2016-03-27 00:53:00,No,Jakarta Timur,Daerah Khusus Ibukota Jakarta,Furniture,0,3,03/27/2016,0,0,5
1,80.23,31,479092950.0,193.77,Laki-Laki,2016-04-04 01:39:00,No,Denpasar,Bali,Food,1,4,04/04/2016,1,0,4
2,69.47,26,418501580.0,236.50,Perempuan,2016-03-13 20:35:00,No,Surabaya,Jawa Timur,Electronic,20,3,03/13/2016,0,0,1
3,74.15,29,383643260.0,245.89,Laki-Laki,2016-01-10 02:31:00,No,Batam,Kepulauan Riau,House,2,1,01/10/2016,1,0,7
4,68.37,35,517229930.0,225.58,Perempuan,2016-06-03 03:36:00,No,Medan,Sumatra Utara,Finance,3,6,06/03/2016,0,0,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
994,43.70,28,441888720.0,173.01,Perempuan,2016-04-04 03:57:00,Yes,Tasikmalaya,Jawa Barat,Fashion,3,4,04/04/2016,0,1,2
995,72.97,30,499691990.0,208.58,Laki-Laki,2016-02-11 21:49:00,Yes,Semarang,Jawa Tengah,Finance,21,2,02/11/2016,1,1,3
996,51.30,45,474475190.0,134.42,Laki-Laki,2016-04-22 02:07:00,Yes,Pakanbaru,Riau,Electronic,2,4,04/22/2016,1,1,1
998,55.55,19,293445530.0,187.95,Perempuan,2016-03-24 02:35:00,No,Tangerang,Banten,Bank,2,3,03/24/2016,0,0,0
999,45.01,26,209130600.0,178.35,Perempuan,2016-06-03 21:43:00,Yes,Serang,Banten,Travel,21,6,06/03/2016,0,1,9

# Daily Time Spent on Site Wise

In [72]:
exclude = set(df_clean.drop(columns=['Daily Time Spent on Site', 'Daily Internet Usage', 'Timestamp', 'Area Income', 'male', 'adclicked', 'catego']))

for x in exclude:
    print(f"Results for grouping by {x}:")
    display(
        df_clean.groupby(x)
        .agg({'Daily Time Spent on Site': 'sum'})
        .sort_values('Daily Time Spent on Site', ascending=False)
        .reset_index()
    )

Results for grouping by Clicked on Ad:

  Clicked on Ad  Daily Time Spent on Site
0            No                  36680.29
1           Yes                  25750.23

Results for grouping by category:

     category  Daily Time Spent on Site
0    Otomotif                   6960.43
1       House                   6789.95
2      Health                   6613.16
3     Fashion                   6293.05
4   Furniture                   6291.41
5        Food                   6273.65
6  Electronic                   6005.53
7      Travel                   5999.00
8        Bank                   5873.87
9     Finance                   5330.47

Results for grouping by province:

                         province  Daily Time Spent on Site
0   Daerah Khusus Ibukota Jakarta                  16319.83
1                      Jawa Barat                  13135.28
2                      Jawa Timur                   5677.71
3                          Banten                   4600.75
4                     Jawa Tengah                   3320.46
5                   Sumatra Utara                   2978.60
6                 Sumatra Selatan                   2440.12
7                Kalimantan Timur                   2273.27
8                  Kepulauan Riau                   2223.50
9                         Lampung                   1885.03
10               Sulawesi Selatan                   1815.64
11             Kalimantan Selatan                   1304.97
12                           Riau                   1277.17
13                           Bali                   1186.79
14                  Sumatra Barat                   1184.47
15               Kalimantan Barat                    806.93

Results for grouping by city:

                 city  Daily Time Spent on Site
0             Bandung                   4133.26
1       Jakarta Timur                   3938.74
2     Jakarta Selatan                   3909.75
3            Surabaya                   3900.72
4       Jakarta Barat                   3836.15
5              Bekasi                   3589.47
6               Medan                   2978.60
7       Jakarta Utara                   2929.16
8            Semarang                   2536.39
9           Palembang                   2440.12
10              Batam                   2223.50
11          Tangerang                   2108.93
12              Depok                   2016.97
13     Bandar Lampung                   1885.03
14  Tangerang Selatan                   1843.09
15           Makassar                   1815.64
16             Malang                   1776.99
17              Bogor                   1736.82
18      Jakarta Pusat                   1706.03
19        Banjarmasin                   1304.97
20          Pakanbaru                   1277.17
21         Balikpapan                   1238.93
22           Denpasar                   1186.79
23             Padang                   1184.47
24          Samarinda                   1034.34
25             Cimahi                    939.17
26          Pontianak                    806.93
27          Surakarta                    784.07
28        Tasikmalaya                    719.59
29             Serang                    648.73

Results for grouping by month:

   month  Daily Time Spent on Site
0      2                   9870.24
1      3                   9507.37
2      4                   9500.99
3      1                   9237.17
4      5                   9080.62
5      6                   8799.47
6      7                   6434.66

Results for grouping by timestamp:

      timestamp  Daily Time Spent on Site
0    04/04/2016                    799.41
1    02/14/2016                    767.28
2    02/26/2016                    723.92
3    02/15/2016                    680.89
4    01/05/2016                    630.99
..          ...                       ...
197  01/19/2016                     73.19
198  07/12/2016                     70.39
199  07/24/2016                     69.15
200  05/06/2016                     53.30
201  05/21/2016                     47.51

[202 rows x 2 columns]

Results for grouping by Age:

    Age  Daily Time Spent on Site
0    31                   4123.71
1    29                   3307.42
2    36                   3286.08
3    28                   3184.11
4    33                   2789.28
5    30                   2684.20
6    34                   2653.88
7    32                   2575.51
8    26                   2492.47
9    35                   2465.58
10   40                   2307.01
11   27                   2265.62
12   37                   2212.50
13   38                   2060.82
14   25                   1926.74
15   41                   1871.17
16   39                   1743.37
17   45                   1664.71
18   42                   1369.13
19   24                   1339.87
20   44                   1311.33
21   43                   1276.85
22   23                   1243.86
23   50                   1066.43
24   46                   1012.07
25   49                    906.28
26   48                    866.91
27   22                    778.54
28   52                    767.16
29   47                    684.68
30   51                    618.14
31   53                    531.77
32   54                    497.97
33   55                    420.54
34   21                    410.76
35   19                    365.80
36   20                    330.63
37   57                    317.62
38   58                    241.31
39   60                    189.97
40   59                    113.20
41   56                     89.44
42   61                     66.08

Results for grouping by hour:

    hour  Daily Time Spent on Site
0      7                   3393.03
1     21                   3253.78
2      9                   3063.45
3     20                   3033.40
4      5                   2827.92
5     23                   2711.03
6      0                   2705.10
7      8                   2693.59
8     22                   2691.47
9     14                   2664.26
10    13                   2659.73
11     4                   2624.24
12     3                   2591.54
13    18                   2523.36
14    11                   2520.49
15    19                   2483.29
16    17                   2482.18
17    16                   2390.10
18    12                   2307.56
19     2                   2300.67
20     6                   2203.25
21    15                   2145.74
22     1                   2111.65
23    10                   2049.69

Results for grouping by Male:

        Male  Daily Time Spent on Site
0  Perempuan                  32668.32
1  Laki-Laki                  29762.20

# Clicked on Ad Wise